//
//  UserAgreementViewModel.swift
//  TravelSchedule
//
//  Created by Rodion Kim on 2025/09/06.
//

import SwiftUI

final class UserAgreementViewModel: ObservableObject {
    var title: String = ""
    var legalInfo: String = ""
    var subtitle: String = ""
    var paragraph: String = ""
    
    init() {
        loadMockAgreement()
    }
    
    private func loadMockAgreement() {
        title = "Оферта на оказание образовательных услуг дополнительного образования Яндекс.Практикум для физических лиц"
        
        legalInfo = "Данный документ является действующим, если расположен по адресу: https://yandex.ru/legal/practicum_offer\nРоссийская Федерация, город Москва"
        
        subtitle = "1. ТЕРМИНЫ"
        
        paragraph = "Понятия, используемые в Оферте, означают следующее:\n\nАвторизованные адреса — адреса электронной почты каждой Стороны. Авторизованным адресом Исполнителя является адрес электронной почты, указанный в разделе 11 Оферты. Авторизованным адресом Студента является адрес электронной почты, указанный Студентом в Личном кабинете.\n\nВводный курс — начальный Курс обучения по представленным на Сервисе Программам обучения в рамках выбранной Студентом Профессии или Курсу, рассчитанный на определенное количество часов самостоятельного обучения, который предоставляется Студенту единожды при регистрации на Сервисе на безвозмездной основе. В процессе обучения в рамках Вводного курса Студенту предоставляется возможность ознакомления с работой Сервиса и определения возможности Студента продолжить обучение в рамках Полного курса по выбранной Студентом Программе обучения. Точное количество часов обучения в рамках Вводного курса зависит от выбранной Студентом Профессии или Курса и определяется в Программе обучения, размещенной на Сервисе. Максимальный срок освоения Вводного курса составляет 1 (один) год с даты начала обучения."
    }
}
